import mongoose from 'mongoose';

// const Post = require('./posts')
import express, {Express, NextFunction, Request, Response} from 'express';
import bodyParser from 'body-parser';

require('dotenv').config();

const cors = require('cors')
const app: Express = express()
const port = process.env.PORT || 4040
mongoose.connect(process.env.MONGODB_URI ?? '');

/*const post = new Post({
    "id": 9,
    "title": "きらきら光る「ホログラム傘」ブーム拡大　異例ヒットにメーカーも驚き...若者人気の背景は",
    "date": "2022-06-11",
    "category": "経済",
    "source": "https://www.j-cast.com/2022/06/11438891.html",
    "image": "https://www.j-cast.com/assets_c/2022/06/news_20220612102429-thumb-645xauto-226977.jpg",
    "lead": "「シャイニーアンブレラ」と呼ばれる傘が、若い世代を中心に広まっている。光の当たり方によってさまざまな色を放つホログラムを用いたビニール傘で、複数のメーカーから製造・販売されている。",
    "content": "<p>「シャイニーアンブレラ」と呼ばれる傘が、若い世代を中心に広まっている。光の当たり方によってさまざまな色を放つホログラムを用いたビニール傘で、複数のメーカーから製造・販売されている。</p><p><b>傘の「新しい使い方」を提案し、大ヒット</b></p><p>傘メーカーのワールドパーティー(大阪市)は、20年6月にホログラムのような生地を用いた「シャイニーアンブレラ」を発売した。</p><p>同社によれば、傘は「1万本売れたらヒット」だと言われるなか、シャイニーアンブレラの累計販売数は22年5月時点で約25万本を記録したという。</p><blockquote>「元々キラキラ輝くシャイニー生地を使った傘は市場に出回っていましたが、可愛いデザインのものが少ないのが現状でした。そこで傘を持ったときの見え方やディテールにこだわり、今っぽく、Wpc. （編注・同社のブランド）っぽく仕上げ、さらにシャイニーアンブレラの『新しい使い方』を提案したところ、大ヒット商品となりました」</blockquote><p>ワールドパーティーは、雨をよけるためだけではなく「晴れの日も自撮りなど写真で楽しんでもらえるツール」として傘の新しい楽しみ方を発信した。すると新しいものに敏感な若い層を中心に受け入れられ、「楽しめる傘」として自撮りやポートレートなどに用いられるアイテムとして広がっていったという。</p><blockquote>「ファッションや流行に敏感な10代～20代をターゲットとしていましたが、実際には年齢や性別を問わず、幅広い方にご使用いただいています。その他、アーティストのビジュアルやライブでも使用されているようです」</blockquote><p>ワールドパーティーはヒットの背景を「誰でも簡単に映える写真が撮れるので、撮影した写真をSNSに投稿し、それが広がっていく、という流れからブームになったと感じています」と分析する。</p><p>同社のシャイニーアンブレラは発売時から好評だったそうで、21年の梅雨時期にはメディアでも取り上げられさらに人気が高まったと振り返る。22年の売り出しも好調で、今後も展開を増やす見込みだ。</p><p><b>ビニール傘に「特別感」を</b></p><p> シャイニーアンブレラと名づけられたビニール傘は、複数のメーカーが製造・販売をしている。</p><p>日本で初めてビニール製の傘カバーを製造・販売したと言われる傘メーカーの小川（名古屋市）は21年5月、「（コンビニなどで売られている）『ビニール傘で十分』と思っている20代が傘に興味を持ってくれるキッカケになれば」と、シャイニーアンブレラを発売した</p><blockquote>「魅力は虹色に光る生地です。見る角度や光の当たり方で表情が違うので、見ていて飽きないです」</blockquote><p> いわゆる一般的なビニール傘とは異なる「特別感」を出すために、持ち手にもこだわった。不透明から透明になるようなグラデーションにしたうえで、透明な部分にはラメを散らした。</p><p>小川のシャイニーアンブレラは、販売1か月で初回入庫分が完売。その後も受注が相次いだ。客からは「とにかく目立つ！可愛い！」という声が多数寄せられたという。こうした反響を受けて、現在は子供用や人気ブランドとコラボしたものも販売している。</p><p><b>豊富なデザインの登場で購入する年代も広がっている</b></p><p>生活雑貨店を展開するロフト（東京都千代田）では、19年春夏に渋谷の商品担当者がシャイニーアンブレラの取り扱いを開始した。</p><blockquote>「2019年の展開当初、渋谷ロフトの公式Twitterで写真投稿したところ、いいねが600以上、リツイートも100以上と話題に。この投稿がきっかけで認知度が高まったのと、視認性の良さや傘としての機能性を店頭で感じられた方も多いようです」</blockquote><p></p><p>渋谷店では、展開してすぐに入荷分が完売した。取材に対し、ロフトの担当バイヤーは、「光や透け感を楽しむ」という新しい価値観が客のニーズに合っている考え、20年秋冬からほとんどの店舗でシャイニーアンブレラの販売を開始したと振り返る。</p><p> ロフトでは現在、おおよそ20種類のシャイニーアンブレラを取り扱っており、大型店舗以外でも5～10種類ほどを展開している。SNSに写真を投稿して楽しむ女性に好評だが、デザインのバリエーションが増えたことで、購入する年齢層も広がっているとのことだ。</p><p><cite>（J-CASTニュース編集部 瀧川響子）</cite></p>"
})
post.save()*/

app.use(bodyParser.urlencoded({extended: false}))
app.use(bodyParser.json())

app.use(cors(), (req: Request, res: Response, next: NextFunction) => {
    console.log('Time: ', Date.now())
    next()
})

// app.use("/news", routes);

app.get("*", function (req, res) {
    res.sendStatus(404);
});

app.listen(port, () => {
    console.log(`Example app listening on port ${port}`)
})